src/config/personsok-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:fraga="http://statenspersonadressregister.se/schema/personsok/2023.1/personsokningfraga"
    xmlns:idinfo="http://statenspersonadressregister.se/schema/komponent/metadata/identifieringsinformationWs-1.1"
    xmlns:person="http://statenspersonadressregister.se/schema/komponent/person/person-1.2"
    xmlns:sok="http://statenspersonadressregister.se/schema/komponent/sok/personsokningsokparametrar-1.1"
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>${customerNumber}</wsse:Username>
                <wsse:Password>${assignmentId}</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    
    <soap:Body>
        <fraga:SPARPersonsokningFraga>
            <idinfo:Identifieringsinformation>
                <idinfo:KundNrLeveransMottagare>${customerNumber}</idinfo:KundNrLeveransMottagare>
                <idinfo:KundNrSlutkund>${customerNumber}</idinfo:KundNrSlutkund>
                <idinfo:UppdragId>${assignmentId}</idinfo:UppdragId>
                <idinfo:SlutAnvandarId>spar-lookup</idinfo:SlutAnvandarId>
            </idinfo:Identifieringsinformation>
            <sok:PersonsokningFraga>
                <person:IdNummer>${personnummer}</person:IdNummer>
            </sok:PersonsokningFraga>
        </fraga:SPARPersonsokningFraga>
    </soap:Body>
</soap:Envelope>